doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<title>Ajuda</title>
<!-- 2016-12-09 sex 10:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link href="https://fonts.googleapis.com/css?family=Ubuntu:400,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" type="text/css" href="https://urionlinejudge.r.worldssl.net/repository/contest.css" />

</head>
<body>
<div id="content">
<h1 class="title">Ajuda</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. CCR</a>
<ul>
<li><a href="#sec-1-1">1.1. Adicionar CCR</a></li>
<li><a href="#sec-1-2">1.2. Visualizar CCR</a></li>
<li><a href="#sec-1-3">1.3. Excluir CCR</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Professores</a>
<ul>
<li><a href="#sec-2-1">2.1. Adicionar professor</a></li>
<li><a href="#sec-2-2">2.2. Visualizar professores</a></li>
<li><a href="#sec-2-3">2.3. Excluir professor</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Restrição</a>
<ul>
<li><a href="#sec-3-1">3.1. Adicionar restrição</a></li>
<li><a href="#sec-3-2">3.2. Visualizar restrições</a></li>
<li><a href="#sec-3-3">3.3. Excluir restrição</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Associação de CCR e professor</a>
<ul>
<li><a href="#sec-4-1">4.1. Associar CCR a professor</a></li>
<li><a href="#sec-4-2">4.2. Visualizar associação de CCRs a professores</a></li>
<li><a href="#sec-4-3">4.3. Excluir associação de professor e CCR</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Outros</a>
<ul>
<li><a href="#sec-5-1">5.1. Limpar tela</a></li>
<li><a href="#sec-5-2">5.2. Limpar grade</a></li>
<li><a href="#sec-5-3">5.3. Fixar CCR em horário</a></li>
<li><a href="#sec-5-4">5.4. Gerar PDF dos horários gerados</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CCR</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Adicionar CCR</h3>
<div class="outline-text-3" id="text-1-1">
<p>
   Para adicionar um novo CCR, deve ser acessada a tela "CCR" a partir do menu contido na parte superior da aplicação. Em sequência, devem ser preenchidos os campos,
onde "Código" corresponde ao código do CCR, "Componente curricular" à seu nome, "Fase" à fase cujo CCR pertence (1 a 10) e "Turno do dia" ao turno em que o CCR
será ofertado (matutino, vespertino ou noturno). Os campos "Fase" e "Turno do dia" devem ser preenchidos clicando-se no campo e, a partir da utilização das setas
para cima e para baixo, selecionando uma das opções apresentadas através de um enter ou de um clique com o botão direito do mouse. Por fim, o CCR deve ser salvo através
do botão de salvar (ícone de disquete).
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Visualizar CCR</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Para visualizar os CCRs cadastrados, deve ser acessada a tela "CCR" a partir do menu contido na parte superior da aplicação.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Excluir CCR</h3>
<div class="outline-text-3" id="text-1-3">
<p>
   Para excluir um CCR, deve ser acessada a tela "CCR" a partir do menu contido na parte superior da aplicação. Em sequência, deve ser localizado o CCR na lista
apresentada e clicado no botão de deletar (ícone de lixeira).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Professores</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Adicionar professor</h3>
<div class="outline-text-3" id="text-2-1">
<p>
   Para adicionar um novo professor, deve ser acessada a tela "Professores" a partir do menu contido na parte superior da aplicação. Em sequência, devem ser preencidos
os campos "SIAPE" e "Nome do professor" e clicado no botão de salvar (ícone de disquete).
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Visualizar professores</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Para visualizar os professores cadastrados, deve ser acessada a tela "Professores" a partir do menu contido na parte superior da aplicação.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Excluir professor</h3>
<div class="outline-text-3" id="text-2-3">
<p>
   Para excluir um professor, deve ser acessada a tela "Professores" a partir do menu contido na parte superior da aplicação. Em sequência, deve ser localizado o
professor na lista apresentada e clicado no botão de deletar (ícone de lixeira).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Restrição</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Adicionar restrição</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Visualizar restrições</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Para visualizar as restrições cadastradas, deve ser acessada a tela "Restrições" a partir do menu contido na parte superior da aplicação.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Excluir restrição</h3>
<div class="outline-text-3" id="text-3-3">
<p>
   Para excluir uma restrição, deve ser acessada a tela "Restrições" a partir do menu contido na parte superior da aplicação. Em sequência, deve ser localizada a
restrição na lista apresentada e clicado no botão de deletar (ícone de lixeira).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Associação de CCR e professor</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Associar CCR a professor</h3>
<div class="outline-text-3" id="text-4-1">
<p>
   Para associar um CCR a um professor, deve ser acessada a tela "Associações" a partir do menu contido na parte superior da aplicação. Em sequência, devem ser
preencidos os campos "Nome do professor", "Componente curricular" e "Turno do dia". Os campos devem ser preenchidos clicando-se no campo e, a partir da utilização das
setas para cima e para baixo, selecionando uma das opções apresentadas através de um enter ou de um clique com o botão direito do mouse. Por fim, a associação deve
ser salva através do botão de salvar (ícone de disquete).
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Visualizar associação de CCRs a professores</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Para visualizar as associações cadastradas, deve ser acessada a tela "Associações" a partir do menu contido na parte superior da aplicação.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Excluir associação de professor e CCR</h3>
<div class="outline-text-3" id="text-4-3">
<p>
   Para excluir uma associação, deve ser acessada a tela "Associações" a partir do menu contido na parte superior da aplicação. Em sequência, deve ser localizada a
associação na lista apresentada e clicado no botão de deletar (ícone de lixeira).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Outros</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Limpar tela</h3>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Limpar grade</h3>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Fixar CCR em horário</h3>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Gerar PDF dos horários gerados</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-12-09 sex 10:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
